<?php
    return [
        // 用户模块 10
        10 => [
            1001 => '请先授权用户信息'
        ],
        // 订单模块 11
        11 => [
            1101 => '总价小于最低起送费',
            1102 => '该门店预约已满',
            1103 => '订单未支付',
            1104 => '生成订单失败',
        ],
        // 门店模块 12
        12 => [
            1201 => '该门店不在营业中',
            1202 => '请先配置门店货架',
            1203 => '门店不存在'
        ],
        // 商品模块 13
        13 => [
            1301 => '商品信息错误',
            1302 => '商品已经下架',
        ],
        // 叫号模块 14
        14 => [
            1401 => '该订单尚未叫号',
            1402 => '该订单不在制作中',
        ],
        // 参数错误模块 15
        15 => [
            1501 => '请传入以下参数'
        ],
        // 16 退款模块
        16 => [
            1601 => '退款金额大于总金额',
            1602 => '退款失败',
        ],
        // 97 优惠券模块
        97 => [
            9701 => '优惠券数据出错',
            9702 => '优惠券核销失败',
            9703 => '新用户已领取优惠券',
            9704 => '优惠券验证数据出错',
            9705 => '不是测试用户',
            9706 => '订单参数错误',
            9707 => '优惠券不可用',
        ],
        // 98积分模块
        98 => [
            9801 => '积分录入出错',
            9802 => '积分减少出错',
            9803 => '积分验证数据出错',
            9804 => '积分列表数据出错'
        ]
    ]
?>
